Repository: OpenChain-Project/Reference-Material
Catalog: Training-Slides/Official/1.0/ko/Translation-Tools/Curriculum-Translation-KR-level2.tmx
Source language: en_us
Languages: ko

source: "Distributed Compliance Artifacts" (as defined in the OpenChain specification), including appropriate notice files are included in the distribution package or other delivery method
ko: 적절한 고지 파일을 포함하는(OpenChain 설명서에 정의된) "배포할 컴플라이언스 결과물"은 배포 패키지 혹은 다른 전달 방법에 포함된다.

source: (according to EPL-1.0) under EPL-1.0 only.
ko: (EPL-1.0에 의하면), EPL-1.0에 의해서만 배포되어야 한다.

source: (according to GPL-2.0) be distributed under GPL-2.0 only, and
ko: (GPL-2.0에 의하면), GPL-2.0에 의해서만 배포되어야 하고,

source: (analyzing the
ko: (스캔 도구 또는 검사에 의해 보고된 "발견(hits)"에 대한 분석)

source: - A change in the FOSS license for the new version of the FOSS component(e.g. ghostscript https://en.wikipedia.org/wiki/Ghostscript )
ko: - FOSS 컴포넌터의 새로운 버전에서 FOSS License의 변경 (예: ghostscript https://en.wikipedia.org/wiki/Ghostscript )

source: - Follow developer guidelines, especially for any FOSS code included in or linked to proprietary code
ko: - 개발자 가이드라인을 따릅니다. 특히 독점 코드에 포함되거나 링크된 FOSS 코드에 대해서는 개발자 가이드라인을 따릅니다.

source: - Gather and retain FOSS project information for your review process
ko: - 리뷰 프로세스를 위한 FOSS 프로젝트 정보를 수집하고 유지합니다.

source: - License compliance for any disclosed FOSS embedded in the in-bound software
ko: - 입수된 소프트웨어에 포함된 공개된 FOSS에 대한 라이선스 컴플라이언스

source: - New dependencies introduced with new versions which create additional FOSS obligations.
ko: - 추가적인 FOSS 의무를 발생시키는 새로운 버전에서 도입된 새로운 종속성

source: - Preserve existing licensing information
ko: - 기존 라이선싱 정보를 보존합니다.

source: - Review OSS compliance for new versions of OSS
ko: - FOSS의 새로운 버전에 대한 FOSS 컴플라이언스를 리뷰합니다.

source: - Review and approve all FOSS early in the cycle
ko: - 모든 FOSS를 초기에 리뷰하고 승인합니다.

source: - Review architecture and avoid mixing components governed by incompatible licenses
ko: - 아키텍터를 검토하고 호환되지 않는 라이선스가 적용되는 컴포넌트들을 혼합하지 않습니다.

source: - Seek guidance
ko: - 가이드라인을 따릅니다.

source: - Select code from high quality FOSS communities
ko: - 고품질의 FOSS 커뮤니티로에서 코드를 선택합니다.

source: - The potential for creating license conflicts by integrating inbound software with other FOSS or proprietary software
ko: - 입수된 소프트웨어를 다른 FOSS 또는 독점 소프트웨어와 통합하여 라이선스 충돌을 만들 가능성

source: - Undisclosed or unknown FOSS included in the in-bound software
ko: - 입수된 소프트웨어에 포함된 공개되지 않은 또는 알려지지 않은 FOSS

source: - Verify OSS compliance for every product and every version prior to release
ko: - 출시하기 전에 모든 제품 및 모든 버전의 FOSS 컴플라이언스를 확인합니다.

source: 3 rd Party Commercial
ko: 제3자 상용

source: 3 rd Party Software
ko: 제3자 소프트웨어

source: This is a placeholder slide to identify where your FOSS policy can be found (OpenChain Specification 1.1, section 1.1.1) >>
ko: 이것은 당신의 FOSS 정책이 어디서 발견될 수 있는지 알려주기 위한 견본용 슬라이드이다. (OpenChain 설명서 1.1, 1.1.1절) >

source: Discovery
ko: 발견

source: The FOSS license may restrict use of the copyright holder name or trademark, may require modified versions to use a different name to avoid confusion, or may terminate upon any breach.
ko: FOSS 라이선스는 저작권자의 이름이나 상표의 사용을 제한할 수 있고 혼란을 피하기 위하여 수정버전에는 다른 이름을 사용할 것을 요구하거나, 모든 위반시에 해지될 수 있다.

source: You may need to maintain modified versions or derivative works under the same license that governs the FOSS component.
ko: 귀하는 특정 FOSS 컴포넌트의 수정물 또는 2차적 저작물에 그 컴포넌트에 적용되는 라이선스와 동일한 라이선스가 유지되도록 할 필요가 있을 수 있다.

source: You may need to provide source code for the FOSS software, for modifications you make, for combined or linked software, and scripts that control the build process.
ko: 귀하는 FOSS 소프트웨어, 귀하가 작성한 수정 저작물, 결합되거나 링크된 소프트웨어에 대한 소스코드와 빌드 프로세스를 제어하는 스크립트를 제공할 필요가 있을 수 있다.

source: You should have a process for identifying and tracking FOSS components that are present in your software
ko: 귀하는 귀하의 소프트웨어에 존재하는 FOSS 컴포넌트를 식별하고 추적하는 절차를 가져야 한다.

source: Your process should be capable of handling FOSS license obligations that arise from your organization’s business practices
ko: 귀하의 절차는 귀하의 조직의 비즈니스 실무에서 생성되는 FOSS 라이선스 의무를 관리할 수 있어야 한다.

source: Example: Copyright © A. Person (2016)
ko: 예: Copyright © A. Person (2016)

source: A FOSS Review can be the meeting point for engineering, business and legal teams, and can require planning and organization to successfully conduct on a large scale.
ko: FOSS 리뷰는 엔지니어링, 비즈니스 및 법률 팀의 미팅 포인트가 될 수 있으며, 큰규모에서도 성공적으로 수행하기 위한 계획과 조직이 필요할 수 있습니다.

source: A FOSS Review team includes the company representatives that support, guide, coordinate and review the use of FOSS.
ko: FOSS 리뷰 팀에는 FOSS 사용을 지원, 안내, 조정 및 검토하는 회사 대표자가 포함된다.

source: A FOSS compliance program provides various benefits such as an increased understanding of how FOSS impacts your organization, an increased understanding of the costs and risks associated with FOSS, better relations with the FOSS community and increased knowledge of available FOSS solutions.
ko: FOSS 컴플라이언스 프로그램은 FOSS가 조직에 미치는 영향에 대한 이해 증진, FOSS와 관련된 비용 및 위험에 대한 이해 증진, FOSS 커뮤니티와의 관계 개선 및 사용 가능한 FOSS 솔루션에 대한 지식 증가와 같은 다양한 이점을 제공합니다.

source: A complete list of OSI-approved licenses is available at http://www.opensource.org/licenses/
ko: OSI 승인 전체 라이선스 목록은 다음에서 볼 수 있다: http://www.opensource.org/licenses/

source: A compliance record is created (or updated) for the FOSS
ko: FOSS에 대한 컴플라이언스 기록이 생성(또는 업데이트)됨.

source: A developer may copy portions of a FOSS component into your software product.
ko: 개발자는 FOSS 컴포넌트의 일부를 소프트웨어 제품에 복사해 넣을 수 있다.

source: A developer may link or join a FOSS component with your software product.
ko: 개발자는 FOSS 컴포넌트를 귀하의 소프트웨어 제품과 링크하거나 연결할 수 있다.

source: A developer may make changes to a FOSS component, including:
ko: 개발자는 다음을 포함하여 FOSS 컴포넌트를 변경할 수 있다:

source: A developer may transform the code from one state to another.
ko: 개발자는 코드를 어느 상태에서 다른 상태로 변환 할 수 있다.

source: A good example of freely available source code scanning tool is FOSSology, a project hosted by the Linux Foundation: https://www.fossology.org
ko: 무료로 사용할 수 있는 소스 코드 스캐닝 도구의 좋은 예는 Linux Foundatoin에서 호스팅하는 프로젝트인 FOSSology이다. : http://fossology.org

source: A key element to a FOSS Compliance Program is a FOSS Review process.
ko: FOSS 컴플라이언스 프로그램의 핵심 요소는 FOSS 리뷰 프로세스이다.

source: A new version of a previously reviewed FOSS component can create new compliance issues by:
ko: 이전에 리뷰한 FOSS 컴포넌트의 새로운 버전은 다음을 통해 새로운 컴플라이언스 이슈를 만들 수 있습니다:

source: A patent application must be made in a specific jurisdiction in order to obtain a patent in that country. If a patent is awarded, the owner has the right to stop anybody from exercising its functionality, regardless of independent creation
ko: 해당 국가에서 특허를 얻기 위해서는 특정 관할 국가에서 특허 신청을 해야한다. 특허가 부여되면 독립적인 창작에 의한 것인지에 상관없이 특허소유자는 모든 사람에게 그 기능을 행사하지 못하게 할 권리가 있다.

source: A proprietary software license (or commercial license or EULA) has restrictions on the usage, modification and/or distribution of the software
ko: 독점 소프트웨어 라이선스 (또는 상업용 라이선스 또는 EULA)는 소프트웨어의 사용, 수정 및 배포에 대한 제한을 부과한다.

source: A public domain declaration attempts to waive or eliminate any intellectual property rights that the developers may have in the software to make it clear that it can be used without restriction, but the enforceability of these declarations is subject to dispute within the FOSS community and its effectiveness at law varies from jurisdiction to jurisdiction
ko: 퍼블릭도메인 선언은, 소프트웨어가 제한없이 사용될 수 있음을 명확하게 하기 위해 개발자가 소프트웨어에 대해 가진 모든 지적재산권을 포기 또는 제거하려는 것이다. 그러나 이 선언의 집행가능성은 FOSS 커뮤니티 내의 분쟁에 휘말릴 수 있고, 그 법적 유효성은 관할국가마다 다르다.

source: A resolution for each of the flagged files in the report and a resolution for any flagged license conflict
ko: 보고서 내 플래그가 표시된 각 파일에 대한 해결 방법 및 플래그가 표시된 라이선스 충돌에 대한 해결 방법

source: A “license” is the way a copyright or patent holder gives permission or rights to someone else
ko: "라이선스"는 저작권 또는 특허권 소유자가 다른 사람에게 허가 또는 권리를 부여하는 방식이다.

source: Accompanying Source Code Distribution
ko: 동반 소스 코드 배포

source: Accompanying Source Code Distribution – Make source code available as needed.
ko: 동반하는 소스 코드 배포 - 필요에 따라 소스 코드를 제공합니다.

source: Accompanying source code distribution
ko: 동반 소스 코드 배포

source: Accompanying source code is identified with labels as to which product and version to which it corresponds
ko: 동반 소스 코드는 해당하는 어느 제품 및 버전에 대한 레이블로 식별된다.

source: Acknowledge the use of FOSS by providing full copyright and attribution notices
ko: 모든 저작권 및 출처에 관한 고지를 제공함으로써 FOSS의 사용을 인정한다.

source: Adapting
ko: 각색 (Adapting)

source: Adapt existing Business Processes to support the FOSS compliance program
ko: FOSS 컴플라이언스 프로그램을 지원하는데 맞춰 기존 비지니스 프로세스를 수정.

source: Adding
ko: 추가 (Adding)

source: Adding source code modification marking as a verification step before releasing the source code
ko: 소스 코드를 배포하기 전 확인 단계에 소스 코드 수정 표시 과정을 추가한다.

source: Adding/injecting new code into the FOSS component
ko: FOSS 컴포넌트에 새로운 코드 추가 / 주입

source: After Program and Product Management and Engineers have reviewed proposed FOSS components for usefulness and quality, a review of the rights and obligations associated with the use of the selected components should be initiated
ko: 제안된 FOSS 컴포넌트의 유용성및 품질에 대해 프로그램 및 제품 관리자와 엔지니어가 검토 한 후, 선택한 컴포넌트의 사용과 관련된 권리 및 의무에 대한 검토가 시작되어야 한다.

source: All copyright and licensing information is to remain intact in all FOSS components
ko: 모든 저작권 및 라이선스 정보는 모든 FOSS 컴포넌트에서 그대로 유지해야 한다.

source: All of the solutions address specific needs and - for that reason - none will solve all possible challenges
ko: 모든 솔루션은 특정 요구 사항들을 처리하기 때문에 어떤 것도 모든 문제를 해결할 수 없다.

source: Always audit source code you received from your software providers or alternatively make it a company policy that software providers must deliver you a source code audit report for any source code you receive
ko: 항상 소프트웨어 공급 업체로부터 받은 소스 코드를 검사하거나 또는 소프트웨어 공급업체는 제공하는 모든 소스 코드에 대하여 소스 코드 검사 보고서를 제공해야 한다는 회사 정책을 만든다.

source: Always update compliance verification - for every product
ko: 모든 제품에 대해 컴플라이언스 검증을 항상 업데이트한다.

source: An audit is requested to review the source code with a scope a defined as exhaustive or limited according to FOSS policy requirements.
ko: FOSS 정책 요구사항에 따라 포괄적이거나 제한적으로 정의된 범위로 소스 코드를 리뷰하도록 검사가 요청됨.

source: An audit report identifying:
ko: 다음을 식별하는 검사 보고서:

source: An example of IP failure would be commingling of proprietary code and open source code, which may result in making proprietary software available to general public despite company's preference.
ko: IP 실폐의 예로는 독점 코드와 FOSS 코드를 섞이게 하는 것으로, 이는 독점 소프트웨어를 기업의 우선권에도 불구하고 일반 대중에게 공개해야하게 만들 수 있습니다.

source: An example of compliance process failure would be a failure in the process related to audit, review, or approving the open source software.
ko: 컴플라이언스 프로세스 실패의 예는 FOSS를 검사, 리뷰, 또는 승인하는 것과 관련된 프로세스에서의 실패입니다.

source: An example of license compliance failure would be a failure to mark an open source software after modification or to properly list the open source software components in the software or to make the complete and corresponding source code available.
ko: 라이선스 컴플라이언스 실폐의 예로는 수정 후 FOSS에 표시하지 않거나 또는 FOSS 컴포넌트를 적절히 열거하지 않거나, 또는 완전한 소스 코드를 공개하지 않은 것입니다.

source: An example of this would be FFMpeg, which is a free software project that provides the codecs for encoding and decoding videos. However, you would still need a patent license to encode and decode a certain format.
ko: 예를 들어, FFMpeg은 비디오 인코딩 및 디코딩을 위한 코덱을 제공하는 무료 소프트웨어 프로젝트입니다. 그러나 특정 형식을 인코딩하고 디코딩하려면 특허 라이센스가 필요합니다.

source: Analyze and understand license obligations
ko: 라이선스 의무 분석 및 이해

source: Analyzing Proposed FOSS Usage
ko: 제안된 FOSS 사용 분석

source: And for every upgrade to newer versions of FOSS
ko: 그리고 새로운 버전의 FOSS로 업그레이드 할때마다

source: Another legal entity within the business group (this may count as distribution)
ko: 비지니스 그룹 내 다른 법인 (이는 배포로 여겨질 수 있다)

source: Anticipate Compliance Process Requirements
ko: 컴플라이언스 프로세스 요구사항을 예측

source: Anyone working with FOSS in the company should be able to initiate a FOSS Review, including Program or Product Managers, Engineers, and Legal.
ko: 프로그램 또는 제품 관리자, 엔지니어, 법무팀을 포함하여 회사내에서 FOSS 관련 일을 하는 사람은 누구든지 FOSS 리뷰를 시작할 수 있어야 한다.

source: Applications downloaded to a user’s machine or mobile device
ko: 사용자의 기계 또는 모바일 기기에 다운로드된 애플리케이션

source: Approval information from the previous step should be tracked or registered so that anyone releasing the software can understand and comply with the relevant license obligations.
ko: 소프트웨어를 출시하는 모든 사람이 관련 라이선스 의무를 이해하고 준수할 수 있도록 이전 단계의 승인 정보는 추척되거나 등록되어야 합니다.

source: Approvals
ko: 승인

source: Approvals - Communicate approval conditions and license obligations.
ko: 승인 - 승인 조건과 라이선스 의무를 전달합니다.

source: Approvals should be made at appropriate authority levels
ko: 승인은 적절할 수준의 권한에서 이루어져야 한다.

source: Architecture Review (Example Template)
ko: 아키텍처 리뷰 (예시 템플릿)

source: Architecture reviews examine the relationships between FOSS components and company software.
ko: 아키텍처 리뷰는 FOSS 컴포넌트와 회사 소프트웨어 간의 관계를 리뷰합니다.

source: Are Freeware and Shareware software considered FOSS?
ko: 프리웨어와 쉐어웨어 소프트웨어는 FOSS로 여겨지는가?

source: As a company that uses FOSS in a commercial product, it is best to create and maintain a good relationship with the FOSS community - in particular, with the specific communities related to the FOSS projects you use and deploy in your commercial products.
ko: 상용 제품에 FOSS를 사용하는 회사라면 FOSS 커뮤니티(특히 상용 제품에 사용하고 배포하는 FOSS 프로젝트와 관련된 특정 커뮤니티)와 좋은 관계를 만들고 유지하는 것이 가장 좋다.

source: Attribution and Notices. You may need to provide or retain copyright and license text in the source code and/or product documentation or user interface, so that downstream users know the origin of the software and their rights under the licenses.
ko: 출처와 고지. 귀하는 하위 사용자들이 소프트웨어의 출처와 라이선스하의 자신들의 권리를 알 수 있도록 소스코드 및/또는 제품 문서 또는 사용자 인터페이스에 저작권과 라이선스 본문을 제공하거나 유지할 필요가 있다.

source: Attribution and other notices and URLs
ko: 저작자 및 다른 고지와 URL

source: Attribution notice – a notice included in the product release that acknowledges the identity of the original authors and / or sponsors of the FOSS included in the product.
ko: 저작자 고지 – 제품에 포함되는 FOSS의 원 저작자와/또는 스폰서의 동일성을 인정하는, 제품 출시에 포함시키는 고지.

source: Audit
ko: 검사

source: Audit source code
ko: 소스 코드 검사

source: Auditing Source Code
ko: 소스 코드 검사

source: Auditing source code - Review identified FOSS components for license and origin information.
ko: 소스 코드 검사 - 라이선스 및 출처 정보에 대해 식별된 FOSS 컴포넌트를 리뷰합니다.

source: Auditors "waived" all the red-flagged items in a report, or that the review and approval process takes too long.
ko: 검사담당자는 보고서에 적색으로 표기된 모든 항목을 보류(waive)할 수 있습니다. 그렇지 않으면 승인 프로세스가 너무 오래 걸립니다.

source: Audits or scans are performed iteratively based on the software development and release lifecycles
ko: 검사 또는 스캔은 소프트웨어 개발 및 출시 주기에 따라 반복적으로 수행됨.

source: Automated source code scanning tools may be used for this purpose
ko: 이를 위해 자동화된 소스 코드 스캐닝 도구가 사용될 수 있다.

source: Avoidance
ko: 방지

source: Avoiding Compliance Pitfalls
ko: 컴플라이언스 함정 피하기

source: Based on the results of the software audit and review in previous steps, software may or may not be approved for use
ko: 이전 단계의 소프트웨어 검사 및 리뷰 결과에 따라 소프트웨어 사용이 승인되거나 승인되지 않을 수 있다.

source: Basic rule: copyright protects creative works
ko: 기본 규칙 : 저작권은 창의적 작품을 보호

source: Because FOSS licenses usually apply during distribution, this is a key point to consider in a compliance program.
ko: FOSS 라이선스는 일반적으로 배포할 때 적용되므로 컴플라이언스 프로그램에서 고려해야할 핵심 사항입니다.

source: Benefits of a robust FOSS Compliance program include:
ko: 견고한 FOSS 컴플라이언스 프로그램의 혜택은 다음과 같다:

source: Better relations with the FOSS community and FOSS organizations
ko: FOSS 커뮤니티 및 FOSS 조직과의 관계 개선

source: Binary delivery
ko: 바이너리 제공

source: Business and engineering teams may receive and implement guidance
ko: 비즈니스 및 엔지니어링 팀은 가이드를 받아 이행할 수 있습니다.

source: CHAPTER 1
ko: 1장

source: CHAPTER 2
ko: 2장

source: CURRICULUM
ko: 커리큘럼

source: Can software be subject to a patent?
ko: 소프트웨어가 특허 대상이 될 수 있는가?

source: Changes to the existing program (e.g., additions, deletions of code in a file, combining components together)
ko: 현재 프로그램에 대한 변경(예, 추가, 파일안의 코드 제거, 컴포넌트들의 결합)

source: Changing
ko: 변경 (Changing)

source: Check Your Understanding
ko: 이해도 점검

source: Check information for completeness, consistency and accuracy.
ko: 완전성, 일관성 및 정확성에 대한 정보를 확인하십시오.

source: Combining
ko: 결합 (Combining)

source: Commercial use is a field of use so any restriction prevents the license from being FOSS
ko: 상업적 용도는 용도분야이어서 그에 대한 어떤 제한을 하는 라이선스는 FOSS가 되지 못한다.

source: Common scenarios include:
ko: 일반적인 시나리오는 다음을 포함한다:

source: Community project
ko: 커뮤니티 프로젝트

source: Companies may have similar processes in place for proprietary components. FOSS components are called "Supplied Software" in the OpenChain specification.
ko: 회사는 독점 컴포넌트를 위한 유사한 프로세스를 가질 수 있다. FOSS 컴포넌트는 OpenChain 설명서에서 "공급 대상 소프트웨어 (Supplied Software)"라고 불린다.

source: Companies must make compliance a priority before any product (in whatever form) ships
ko: 기업은 제품 (어떤 형태이든지) 출하 전에 컴플라이언스를 우선시 해야 한다.

source: Companies pick the solution most suited to their specific market area and product
ko: 회사들은 특정 시장 영역 및 제품에 가장 적합한 솔루션을 선택해야 한다.

source: Compile notices for publication
ko: 공개를 위한 고지문 수집

source: Compile notices
ko: 공개를 위한 컴파일 고지

source: Compiling into binary
ko: 바이너리로 컴파일

source: Compliance Benefits
ko: 컴플라이언스 혜택

source: Compliance Pitfalls
ko: 컴플라이언스 함정

source: Compliance Process
ko: 컴플라이언스 프로세스

source: Compliance Process Applies to all FOSS components
ko: 모든 FOSS 컴포넌트에 대해 컴플라이언스 프로세스 적용

source: Compliance Process Failures
ko: 컴플라이언스 프로세스 실패

source: Compliance Process pitfalls
ko: 컴플라이언스 프로세스 함정

source: Compliance management is a set of actions that manages FOSS components used in products.
ko: 컴플라이언스 관리는 제품에 사용되는 FOSS 컴포넌트를 관리하는 일련의 작업이다.

source: Compliance management is a set of actions that manages OSS components used in products.
ko: 컴플라이언스 관리는 제품에 사용되는 FOSS 컴포넌트를 관리하는 일련의 작업이다.

source: Conduct review with reference to your FOSS policy
ko: FOSS 정책을 참고하여 리뷰를 수행한다.

source: Conducting periodic full scan for the software platform to detect any “undeclared” FOSS usage
ko: "신고되지 않은" FOSS 사용을 발견하기 위해 소프트웨어 플랫폼에 대해 정기적으로 전체 스캔을 수행한다.

source: Conducting periodic source code scans/audits
ko: 정기적인 소스 코드 스캔 / 검사 수행

source: Conducting regular code audits
ko: 정기적인 코드 검사를 수행한다.

source: Conducting regular source code scans or audits for all the source code in the build environment.
ko: 빌드 환경 내 모든 소스 코드에 대해 정기적인 소스 코드 스캔 및 검사를 수행한다.

source: Confirm origin and
ko: 소스 코드의 출처와 라이선스 확인

source: Confirm origin and license of source code
ko: 소스 코드의 출처와 라이선스 확인

source: Confirming that all obligations have been or will be met
ko: 모든 의무가 충족되었거나 충족될 것임을 확인

source: Consumer and brand protection; avoid consumer confusion and brand dilution
ko: 소비자 및 브랜드 보호; 소비자 혼란과 브랜드 가치 저하 방지

source: Contents
ko: 목차

source: Continuously running the dependency tracking tool over your build environment
ko: 빌드 환경에서 종속성 추적 도구를 지속적으로 실행한다.

source: Contribute to and participate in FOSS communities
ko: FOSS 커뮤니티에 기여하고 참가한다.

source: Converting C++ to Java
ko: C++에서 Java로 변환

source: Copyleft-style licenses often have source availability obligations, which require you to provide accompanying source code when you distribute a binary version of a program or library.
ko: Copyleft 스타일 라이선스는 종종 프로그램이나 라이브러리의 바이너리 버전을 배포할 때 동반하는 소스 코드의 제공을 요구하는 소스 코드 제공 의무를 가지고 있습니다.

source: Copyright notices
ko: 저작권 고지

source: Copyright Concepts in Software
ko: 소프트웨어의 저작권 개념

source: Copyright Rights Most Relevant to Software
ko: 소프트웨어와 밀접한 관련있는 저작권상의 권리

source: Copyright generally applies to literary works, such as books, movies, pictures, music, maps
ko: 저작권은 일반적으로 책, 영화, 그림, 음악, 지도와 같은 어문 작품에 적용된다.

source: Copyright notice – an identifier placed on copies of the work to inform the world of copyright ownership.
ko: 저작권 고지 –세상에 대해 저작권 소유권을 알리기 위해 저작물의 사본에 위치시키는 식별자.

source: Copyright notices, attribution, source code for vendor modifications if needed to satisfy license obligations
ko: 라이선스 의무를 충족시키기 위해 필요한 경우, 공급업체 수정에 대한 저작권 고지, 출처 , 소스 코드

source: Copyright owner
ko: 저작권 소유자

source: Copyright protects original works of authorship. It's different than patent in that copyright protects the expression of an idea, whereas patent protects the underlying idea itself.
ko: 저작권은 원본 저작물을 보호합니다. 특허가 아이디어의 표현을 보호하는 반면, 특허는 기본 아이디어 자체를 보호한다는 점에서 특허와 다릅니다.

source: Copyright: protects original works of authorship
ko: 저작권: 저자의 원본 저작물을 보호

source: Creating interdependency
ko: 상호의존성 생성

source: Customer/Partner
ko: 고객/파트너

source: Deleting
ko: 삭제

source: Deleting or removing code
ko: 코드 삭제 또는 제거

source: Depending on the FOSS license(s) involved, your compliance obligations may consist of:
ko: 해당 FOSS라이선스에 따라, 컴플라이언스 의무는 다음으로 구성된다.

source: Description
ko: 설명

source: Description of modifications intended to be made
ko: 만들고자하는 수정사항에 대한 설명

source: Developer Guidelines
ko: 개발자 가이드라인

source: Developers may include a public domain declaration with their software
ko: 개발자들은 자신이 개발한 소프트웨어에 대해 퍼블릭 도메인으로 선언 할 수 있다.

source: Development Tools
ko: 개발 도구

source: Development team's point of contact
ko: 개발팀의 연락 지점

source: Development team's point of contact in case you need to follow up with future FOSS issues.
ko: 향후 FOSS 이슈를 해결해야 할 경우를 위한 개발팀의 연락처입니다.

source: Development tools may perform some of these operations behind the scenes.
ko: 개발 도구가 이러한 작업 중 일부를 내부적으로 수행할 수 있다.

source: Different legal jurisdictions may have different legal requirements. This should be taken into account when using these slides as part of a compliance training program.
ko: 법적 관할국에 따라 법적 요구 사항이 달라질 수 있음. 이 슬라이드를 컴플라이언스 교육 프로그램의 일부로 사용할 때는이 점을 고려하여야 함.

source: Different use cases will have different legal effects.
ko: 사용 사례가 다르면 법적 효력이 달라집니다.

source: Discover all FOSS early in the procurement/development cycle
ko: 구매/개발 주기 초반에 모든 FOSS를 발견.

source: Disjunctive licensing may be something important to explore more deeply when creating a FOSS policy.
ko: 선택형 (Disjunctive) 라이선싱은 FOSS 정책을 수립할 때 보다 깊게 탐구하는 것이 중요할 수 있습니다.

source: Disjunctive = Choice of one open source license or another
ko: 선택형 (Disjunctive) = 하나의 오픈소스 라이선스를 선택합니다.

source: Dissemination of material to an outside entity
ko: 외부 주체에 대한 전파

source: Distribution
ko: 배포

source: Distribution is generally viewed as the provision of a copy of a piece of software, in binary or source code form, to another entity (an individual or organization outside your company or organization)
ko: 배포는 일반적으로 바이너리 또는 소스 코드 형식의 소프트웨어 사본을 다른 주체 (회사 또는 조직 외부의 개인 또는 조직)에게 제공하는 것으로 간주된다.

source: Do not check un-reviewed code into any internal source tree
ko: 리뷰되지 않은 코드를 내부 소스 트리로 포함시키지 않아야 한다.

source: Do not re-name FOSS components unless you are required to under the FOSS license (e.g., required renaming of modified versions)
ko: FOSS 라이선스에 의해 요구 (예: 수정 버전의 이름 변경 요구)되지 않는한 FOSS 컴포넌트의 이름을 변경하지 않아야 한다.

source: Do not remove or in any way disturb existing FOSS licensing copyrights or other licensing information from any FOSS components that you use.
ko: 사용하는 FOSS 컴포넌트의 기존 FOSS 라이선스 저작권 또는 라이선스 정보를 제거하거나 어떤 식으로든 훼손하지 않아야 한다.

source: Does not protect abstract ideas, laws of nature
ko: 추상적인 아이디어, 자연의 법칙을 보호하지는 않는다.

source: Does the declared license match what is in the code files?
ko: 선언된 라이선스가 코드 파일에 있는 것과 일치하는가?

source: Does the license permit use with other components of the software?
ko: 라이선스는 소프트웨어의 다른 컴포넌트와 사용을 허용하는가?

source: Download or source code URL
ko: 다운로드 또는 소스 코드 URL

source: Due diligence of 3rd-party software
ko: 제3자 소프트웨어의 실사

source: E.
ko: 예)

source: E.g, provide attribution, or give a reciprocal license
ko: 예: 저작자 표시 또는 상호적 라이선스 제공

source: E.g., when software is “dual licensed,” the copyright owner gives each recipient the choice of two licenses
ko: 예, 소프트웨어가 “듀얼 라이선스”로 된 경우, 저작권 소유자는 각 수령인에게 두개 라이선스중 하나를 선택권을 준다.

source: E.g., “All of the code and documentation in this software has been dedicated to the public domain by the authors.”
ko: 예) “이 소프트웨어안의 모든 코드와 문서는 저작자가 퍼블릭 도메인에 제공한다.”

source: End to End Compliance Management (Example Processes)
ko: 컴플라이언스 관리 전과정 (프로세스 예시)

source: End to End Compliance Management (Example Process)
ko: 컴플라이언스 관리 전과정 (프로세스 예시)
